{
  "format": "layers-model",
  "generatedBy": "keras v2.12.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": {
    "keras_version": "2.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "layer0_input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "layer0",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "layer1",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "layer2",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "layer3",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "layer7",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": {
        "class_name": "MeanSquaredError",
        "config": { "reduction": "auto", "name": "mean_squared_error" }
      },
      "metrics": [
        [
          {
            "class_name": "MeanSquaredError",
            "config": { "name": "mean_squared_error", "dtype": "float32" }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>RMSprop",
        "config": {
          "name": "RMSprop",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": 100,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "rho": 0.9,
          "momentum": 0.0,
          "epsilon": 1e-7,
          "centered": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "layer0/kernel", "shape": [3, 3], "dtype": "float32" },
        { "name": "layer0/bias", "shape": [3], "dtype": "float32" },
        { "name": "layer1/kernel", "shape": [3, 10], "dtype": "float32" },
        { "name": "layer1/bias", "shape": [10], "dtype": "float32" },
        { "name": "layer2/kernel", "shape": [10, 10], "dtype": "float32" },
        { "name": "layer2/bias", "shape": [10], "dtype": "float32" },
        { "name": "layer3/kernel", "shape": [10, 10], "dtype": "float32" },
        { "name": "layer3/bias", "shape": [10], "dtype": "float32" },
        { "name": "layer7/kernel", "shape": [10, 1], "dtype": "float32" },
        { "name": "layer7/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
